Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/kompetansenorge.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: These objectives are considered goals on the way to level A1 in these skills.
nb: Disse målene regnes som delmål på vei til nivå A1 i disse ferdighetene.

source: conversations, discussions and debates;
nb: synspunkter i samtaler, diskusjoner og debatter

source: example in formal letters, emails and social media;
nb: eksempel i formelle brev, e-poster og sosiale medier

source: • read signs and traffic instructions
nb: • Kan lese og forstå hovedtrekk i fag- og arbeidsrelaterte tekster

source: • Girl are especially exposed to social control.
nb: • Jenter er særlig utsatt for sosial kontroll.

source: • read and understand everyday texts such as letters, emails and posts on
nb: • lese og forstå hverdagslige tekster som brev, e-poster og innlegg på sosiale

source: • employ different reading strategies to understand the main features of a
nb: • bruke ulike lesestrategier for å oppfatte hovedtrekk i en tekst på den målformen

source: many children to have, and when to have them.
nb: hvor mange barn man vil ha, og når dette skal skje.

source: Georg has been receiving unemployment benefit from NAV and
nb: Georg har mottatt både dagpenger fra Nav og lønn som det ikke

source: • explain the content in simple fiction texts;
nb: • gjengi innholdet i enkle skjønnlitterære tekster

source: • convey the content of images and very simple spoken information;
nb: • videreformidle innholdet i bilder og svært enkel muntlig informasjon

source: Like native Norwegian speakers, level C1 language users may need clarification and/or repetition if the spoken variant is unfamiliar.
nb: I likhet med morsmålbrukere av norsk vil språkbrukere på nivå C1 kunne ha behov for oppklaring og/eller gjentakelse hvis talemålsvarianten er ukjent.

source: • read and understand the main points in simple news articles and relatively
nb: • lese og forstå hovedpoeng i enkle nyhetsartikler og relativt enkle tekster

source: Hate crime is defined as criminal acts motivated by a person’s religion, ethnicity, gender identity or disability.
nb: Hatkriminalitet er straffbare handlinger motivert av personers religion, etnisitet, kjønnsidentitet eller funksjonsevne.

source: • employ simple writing strategies to write simple words and phrases.
nb: • bruke noen enkle skrivestrategier for å skrive enkle ord og fraser

source: ‘Norwegianising’ words from other languages they speak;
nb: ved å fornorske ord fra andre språk han/hun kan

source: • Pregnant women who have undergone genital
nb: • Gravide kvinner som er kjønnslemlestet,

source: • provide complex information and clear, detailed instructions and messages;
nb: • gi kompleks informasjon og klare, detaljerte instruksjoner og beskjeder

source: Blattner & Lomicka (2012), who have looked at how a group of students in the USA experience the use of
nb: Også Blattner & Lomicka (2012), som har sett på hvordan en gruppe studenter i USA opplever bruken av

source: specific, everyday words from a very simple context or based on similarities with other languages they speak.
nb: konkrete, dagligdagse ord ut fra en svært enkel kontekst eller med bakgrunn i likheter med andre språk deltakeren snakker

source: Participants’ Norwegian language skills are thus a matter of how they use the language to master challenges and solve tasks in familiar and unfamiliar contexts both within and outside the training.
nb: Deltakernes kompetanse i norsk handler på denne måten om hvordan de klarer å bruke språket til å mestre utfordringer og løse oppgaver i kjente og ukjente sammenhenger, både i og utenfor opplæringen.

source: What does it mean for language learning in Norway that, thanks to the internet, today’s multilingual and multicultural pupils, students and adults ’move’ more than before between different languages, countries and cultures?
nb: Hva betyr det for språkopplæringen i Norge at dagens flerspråklige og flerkulturelle elever, studenter og voksne takket være nettet mer enn før befinner seg i flyt mellom ulike språk, land og kulturer?

source: • A «stranger rape» is rape where rapist is not known to the victim.
nb: • En «overfallsvoldtekt» er voldtekt der offeret ikke kjenner gjerningspersonen.

source: The Norwegian courses available from the University of Oslo, as mentioned in Chapter 1, is one example.
nb: Norsktilbudet til Universitetet i Oslo, som er nevnt i kap. 1, er et eksempel på dette.

source: We try to form an impression of what access to the internet and social media mean to people who move from one country to another, and we also look at the importance of the internet and social media for language learning today.
nb: Vi prøver å danne oss et inntrykk av hva tilgang til Internett og sosiale medier betyr for folk som flytter fra ett land til et annet, og vi ser samtidig på betydningen av nettet og sosiale medier for språkopplæringen i dag.

source: • recognise familiar names, familiar words and very simple phrases in simple
nb: • gjenkjenne kjente navn, kjente ord og svært enkle fraser i enkle autentiske

source: A multi-modal writing and communication culture The reception and production modes of communication are divided into oral reception and production (listen and speak) and written reception and production (read and write).
nb: En multimodal skrifts- og kommunikasjonskultur Kommunikasjonskategoriene resepsjon og produksjon er delt inn i muntlig resepsjon og produksjon (lytte og snakke) og skriftlig resepsjon og produksjon (lese og skrive).

source: person or a rape in a close relationship
nb: er bevisstløs, eller voldtekt i nære

source: • understand specific details in notifications, messages, instructions and
nb: • forstå spesifikke detaljer i meldinger, beskjeder, instruksjoner og

source: • Lesbian, gay, bisexual, transgender and intersexed persons (LGBTI) with minority
nb: • Lesbiske, homofile, bifile, transpersoner og intersex-personer (LHBTI) med

source: underpinning their arguments with supporting points and relevant examples;
nb: syn på saken ved å utvikle og underbygge argumentene sine med underpunkter og relevante eksempler

source: Learners have no difficulty following and contributing to the interaction in formal and informal discussions and conversations, also when the topics are complex and/or unfamiliar.
nb: Innlæreren kan med letthet følge og bidra til samhandling i formelle og uformelle diskusjoner og samtaler, også når det dreier seg om komplekse og/eller ukjente emner.

source: (cf. Wenger 2009) that has been crucial to learning.
nb: Wenger, 2009) som har vært avgjørende for språklæringen.

source: • write using adapted software and apps;
nb: • skrive ved bruk av tilpassede dataprogrammer og apper

source: Participants should be able to take part in simple, familiar spoken situations in everyday life when their conversation partner speaks slowly and clearly and is willing to be supportive.
nb: Deltakeren skal kunne delta i enkle, kjente muntlige samhandlingssituasjoner i dagliglivet når samtalepartneren snakker langsomt og tydelig og er innstilt på å hjelpe.

source: • read working drawings and plans
nb: • lese korte notater og instruksjoner, egne og andres

source: • help others understand words from a text by translating it into a common
nb: • hjelpe andre med å forstå ord fra en tekst ved å oversette til et felles språk,

source: Linguistic production is used, inter alia, when talking about oneself, giving a presentation, or writing a report, and can involve different linguistic acts, like describing, explaining and discussing.
nb: Språklig produksjon brukes blant annet når man forteller om seg selv, holder en presentasjon eller skriver en rapport, og kan involvere ulike språkhandlinger som å beskrive, forklare og drøfte.

source: • express emotions in a nuanced way during a conversation, explain the
nb: • delta i samtaler der en uttrykker følelser på en nyansert måte, framhever

source: • give input for improvements to the working environment
nb: • Ytringsfrihet, menneskerettigheter og trosfrihet

source: • When the mother and her child have returned home, the parents
nb: • Etter at mor og barn har kommet hjem, får foreldrene og den nyfødte oppfølging

source: Memona is only 19 years old and wants to
nb: Memona er bare 19 år, ønsker å ta utdanning og synes selv at hun

source: • Is this rape?
nb: • Er dette voldtekt?

source: Vurdien (2013), who conducted a questionnaire survey after the course, shows in her analysis that the majority of the participants found the method useful, and the fact that they were not ‘just’ writing for a teacher moti-vated many of them to write as well as possible.
nb: Vurdien (2013), som gjennomførte en spørreundersøkelse i etterkant av kurset, viser i sin analyse at flertallet av deltakerne opplevde opplegget som nyttig, og at det faktum at de skrev for andre enn «bare» læreren gjorde at mange ble motivert til å skrive så bra som mulig.

source: Dowling (2013) emphasises the importance of knowing that others are going to read what you have written to the participants’ work, and he proposes adding a fourth
nb: Dowling (2013) understreker betydningen det har for deltakernes arbeid at de vet at andre skal lese det de har skrevet, og han foreslår i denne sammenhengen å utvide den kjente såkalte

source: something, for example sweets, you
nb: for eksempel godteri, bør du ikke

source: • Play provides the foundations for learning and development.
nb: • Leken danner grunnlag for læring og utvikling.

source: The course was based on Vox’s competence goals for
nb: Det finnes få studier som undersøker denne effekten.

source: illustrations, e.g. diagrams;
nb: grafiske framstillinger, for eksempel diagrammer

source: Lisa and Anna have been in a relationship for two years and want to live together.
nb: Lisa og Anna har vært kjærester i to år og skal bli samboere.

source: By unprotected sex
nb: Ved ubeskyttet sex

source: child welfare service can support families;
nb: skole og barnevern, kan støtte familier

source: Lisa wakes Ole and asks him what happened.
nb: Lisa vekker Ole og spør hva som har skjedd.

source: • apply knowledge about key rights, obligations and opportunities as a
nb: • bruke kunnskap om sentrale rettigheter, plikter og muligheter som

source: • read the safety information, brochures, data sheets and
nb: • lese HMS-informasjon, brosjyrer, datablader og oppslag

source: • start or initiate, without preparation, simple conversations and discussions
nb: • starte eller gå uforberedt inn i, opprettholde og avslutte enkle samtaler og

source: The objective of the training is for participants to be able to read and understand words, sentences and short, very simple texts on familiar everyday topics.
nb: Mål for opplæringen er at deltakeren skal kunne lese og forstå ord, setninger og korte, svært enkle tekster om kjente dagligdagse emner.

source: The training will help them acquire the language skills they need to participate actively in Norwegian society, create good lives and contribute their skills.
nb: Faget skal bidra til at de lærer språket de trenger for å ta aktivt del i det norske samfunnet, skape seg gode liv og bidra med sine ressurser.

source: • express their own needs in everyday interactions in very simple terms;
nb: • gi uttrykk for egne behov i dagligdagse samhandlingssituasjoner på en

source: • employ simple strategies to compensate for vocabulary deficits, for example
nb: • bruke enkle strategier for å kompensere for mangler i ordforrådet, for

source: congratulations, and write and comment on posts in digital communication in simple terms;
nb: samt skrive og kommentere innlegg i digital kommunikasjon på en enkel måte

source: Is this discrimination?
nb: • Er dette diskriminering?

source: Excise duties on all tobacco goods are high.
nb: er høye avgifter på alle tobakksvarer.

source: You can talk about what similar situations or areas of life are like in the participant’s home countries and what they are like in Norway.
nb: En kan samtale om hvordan lignende situasjoner eller områder av livet artet seg i hjemlandet, og hvordan dette er i Norge.

source: Participants who follow the Introduction Act in accordance with the transitional rules in the Integration Act section 51 and the Integration Regulations section 72 must also complete 50 hours of training in social studies.
nb: Deltakere som følger introduksjonsloven i henhold til overgangsreglene i integreringsloven § 51 og integreringsforskriften § 72 skal også gjennomføre 50 timer opplæring i samfunnskunnskap.

source: The CEFR Companion Volume stresses that skills at level C are not the same as native language competence.
nb: I Tillegget til Rammeverket understrekes det at ferdigheter på C-nivået ikke er det samme som morsmålskompetanse.

source: The author nonetheless concludes that there is a discrepancy between leisure and school-related use of the internet and digital tools, and that it is generally the teachers who initiate school-related use.
nb: Forfatteren slår likevel fast at det er en diskrepans mellom fritids- og skolerelatert bruk av nett og digitale verktøy, og at det som regel er lærerne som initierer skolerelatert bruk.

source: At this level, language skills cross domains, in accordance with the descriptions in the CEFR and the CEFR Companion Volume.
nb: På dette nivået er språkferdighetene domeneoverskridende i tråd med beskrivelsene i Rammeverket og Tillegget til Rammeverket.

source: • Discriminating against someone on the
nb: • Det er forbudt å diskriminere personer

source: • initiate, maintain and conclude a conversation in an appropriate way, with
nb: • innlede, opprettholde og avslutte en samtale på en passende måte, med

source: • In very serious cases, for example in the case of violence and abuse, the child
nb: • I svært alvorlige saker, som for eksempel vold og mishandling, kan foreldrene

source: information from different websites;
nb: informasjon fra ulike nettsteder

source: • Axel: Hello, is that Ida?
nb: Hallo, er det Ida?

source: Like Muhammad Abdul Basar & Yusop (2014), they conclude that wiki can provide a good framework for group work.
nb: De kommer i likhet med Muhammad Abdul Basar & Yusop (2014) fram til at wiki kan være en god ramme for gruppearbeid.

source: In the same way, Freund (2016) shows that some students do not take advantage of the flexibility of online courses because they do not feel qualified to choose work tasks themselves.
nb: På samme måte viser Freund (2016) at enkelte studenter ikke utnytter fleksibiliteten som ligger i nettbaserte opplegg fordi de ikke føler de er kvalifisert til å velge arbeidsoppgaver selv.

source: Finally, we refer to the study by Burrows & Stepanczuk (2013), which emphasises the importance of
nb: I denne sammenhengen vil vi til slutt vise til Burrows & Stepanczuk (2013), som understreker betydningen av

source: • write detailed descriptions of people, places, events and experiences;
nb: • beskrive personer, steder, hendelser og opplevelser på en detaljert måte

source: • present their competence in a simple CV and in a digital form;
nb: • presentere egen kompetanse i en enkel CV og i et digitalt skjema

source: In order to succeed at this, participants must be able to use their Norwegian language skills together with their other knowledge and skills, and in an interplay with situational resources and other people.
nb: For å lykkes med dette må deltakerne kunne bruke norskferdighetene sammen med andre kunnskaper og ferdigheter de har, og i samspill med ressurser i omgivelsene og andre mennesker.

source: The law on equality between men and women (the Gender Equality Act) was first enacted in 1978. The Act
nb: første gang innført i 1978. Loven gjelder på alle områder Likestilling mellom kvinner og menn

source: • Female genital mutilation is a traditional practice linked to local
nb: • Kjønnslemlestelse er en tradisjonell praksis som er knyttet til lokale

source: • employ appropriate search techniques and reading methods to find relevant
nb: • bruke hensiktsmessige søketeknikker og lesemåter for å finne relevant

source: • write and edit clear and detailed texts adapted to the situation and purpose;
nb: • skrive og bearbeide klare og detaljerte tekster tilpasset situasjon og formål

source: For most of them, this language will be written and spoken Norwegian, but for some it will be Norwegian sign language instead of spoken Norwegian.
nb: For de fleste vil dette språket være norsk muntlig og skriftlig, men for noen kan det være norsk tegnspråk i stedet for norsk muntlig.

source: • In Oslo, there is dedicated resource centre
nb: • I Oslo finnes det også et eget ressurssenter

source: No-one can be persecuted or punished because of their religion or faith.
nb: kan forfølges eller straffes på grunn av sin religion eller sitt livssyn.

source: • write and comment on personal posts and participate in discussions on
nb: • skrive og kommentere personlige innlegg og delta i diskusjoner om kjente

source: • write clear and detailed explanatory texts;
nb: • skrive klare og detaljerte redegjørende tekster

source: Learners can • elaborate on and develop important points without support, and can handle
nb: Innlæreren • kan utdype og videreutvikle viktige punkter uten støtte, og takler avbrytelser og

source: A podcast is a format used by large news media such as the newspapers Aftenposten and VG as well as smaller news media and private individuals to broad-cast clips with different types of content from their websites.
nb: Podcast er et format som store nyhetsmedier som for eksempel Aftenposten og VG, men også mindre nyhetsmedier og privatpersoner bruker for å sende innslag med ulike typer innhold fra sine nettsider.

source: The curriculum places an emphasis on the structure, word choice and expanded and more nuanced descriptor scales incorporated into the CEFR Companion Volume.
nb: I læreplanen er det lagt vekt på strukturen, begrepsbruken og de utvidede og mer nyanserte deskriptorskalaene som er innarbeidet i Tillegget til Rammeverket.

source: grounds of disability is against the law.
nb: Etikk – prinsipper og retningslinjer for god praksis

source: Participants can express and respond to views and arguments and participate in interactions with a level of spontaneous and fluent language that enables communication among the parties involved to flow with ease.
nb: Deltakeren kan uttrykke og respondere på synspunkter og argumenter og delta i samhandlingssituasjoner med et så spontant og flytende språk at kommunikasjonen ikke blir anstrengende for noen av partene.

source: • employ very simple listening strategies, such as deriving the meaning of
nb: • bruke noen svært enkle lyttestrategier, som å utlede betydningen av

source: • read internal routines and instructions
nb: • Kan lese og forstå faglige og jobbrelaterte rapporter

source: genres within their area of interest, but may use wording that is influenced by their native language or other languages they have learned.
nb: ulike sjangre innenfor eget interessefelt, men det kan forekomme formuleringer som er påvirket av morsmålet eller andre språk innlæreren har lært.

source: • write simple coherent texts containing some detailed descriptions about
nb: • skrive enkle sammenhengende tekster om erfaringer, opplevelser,

source: • recognise Norwegian phonemes and be able to match up phonemes and
nb: • gjenkjenne norske fonemer og kunne knytte sammen fonem og grafem

source: setting limits for children?
nb: grenser for barna?

source: • ask and answer very simple, direct questions about personal matters and
nb: • stille og svare på svært enkle, direkte spørsmål om personlige forhold og

source: • employ a number of reading strategies to gain understanding, including
nb: • bruke en rekke lesestrategier for å oppnå forståelse, blant annet prøve å få tak i

source: • What effect would an engagement (a religious promise to marry)
nb: • Hvilken betydning vil en forlovelse (religiøst inngått avtale)

source: Formative assessment The formative assessment will promote learning and expand competence in the subject.
nb: Underveisvurdering Underveisvurderingen skal bidra til å fremme læring og til å utvikle kompetanse i faget.

source: While Vurdien (2013) and Dowling (2013) focus primarily on participants’ writing and cooperation skills, Yang (2016) is concerned with developing the participants’
nb: Hvor Vurdien (2013) og Dowling (2013) i første omgang konsentrerer seg om deltakernes skrive- og samar-beidsferdigheter, er Yang (2016) opptatt av å utvikle deltakernes

source: Competence aims for level B2 (independent user)
nb: Kompetansemål for nivå B2 (selvstendig bruker)

source: Competence is understood as the ability to acquire and apply knowledge and skills in order to master challenges and solve tasks in familiar and unfamiliar contexts and situations.
nb: Kompetanse forstås som det å kunne tilegne seg og anvende kunnskaper og ferdigheter til å mestre utfordringer og løse oppgaver i kjente og ukjente sammenhenger og situasjoner.

source: • express their opinions on topics of personal interest in simple terms;
nb: • uttrykke egne meninger om emner av personlig interesse på en enkel måte

source: • understand the main points and some specific details in conversations and
nb: • forstå hovedpoeng og enkelte spesifikke detaljer i samtaler og diskusjoner

source: because she is too young and is not in full-time employment.
nb: sier at Memona er altfor norsk i tankene sine og går til sengs.

source: It is therefore important to ensure thematic and linguistic cohesion between the basic training in reading and writing, the training in spoken Norwegian, and any other training or activity they take part in.
nb: Det er derfor viktig at det er tematisk og språklig sammenheng mellom grunnopplæringen i lesing og skriving, opplæringen deltakerne får i muntlige ferdigheter, og eventuell annen opplæring og aktivitet deltakerne deltar i.

source: -Do you need mathematics skills in Norway?
nb: -Trenger du matematikk i Norge?

source: • use context to support reading comprehension;
nb: • bruke konteksten som støtte for leseforståelse

source: The students also reported greater learning progress, but this has not been confirmed in any form of test.
nb: Studentene rapporterer om økt læringsprogresjon, men dette er ikke bekreftet i form av noen test.

source: • Sexual assault includes rape, touching and serious threats of a sexual
nb: • Seksuelle overgrep omfatter blant annet voldtekt, beføling og alvorlige

source: • answer simple, direct questions about themselves in very simple terms in an
nb: • svare på enkle, direkte spørsmål om seg selv på en svært enkel måte i en

source: In this curriculum, basic skills in reading, writing and speaking are described through the competence goals in the language skills of listening, reading, writing and speaking.
nb: I denne læreplanen er grunnleggende ferdigheter i lesing, skriving og muntlig beskrevet gjennom kompetansemålene i språkferdighetene lytte, lese, skrive og muntlig.

source: Participation (or non-participation) in the local community was also the topic of a study conducted by Lee & Ranta (2014).
nb: Deltakelse (eller ikke-deltakelse) i lokalsamfunnet er også tema i en studie gjennomført av Lee & Ranta (2014).

source: See section 73 of the Integration Regulations for more detailed transitional rules.
nb: Se integreringsforskriften § 73 for nærmere overgangsregler. Gyldighet og innføring

source: • summarise and convey relevant information from clearly formulated texts on
nb: • sammenfatte og videreformidle relevant informasjon fra klart formulerte

source: The recommended minimum levels of Norwegian for different groups of participants are specified in section 28 of the Integration Regulations.
nb: minimumsnivåer i norsk for ulike grupper deltakere er fastsatt i integreringsforskriften § 28.
